Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f18176.h
extern volatile CRCXORLbits_t CRCXORLbits __at(0x1C9E);
// bitfield macros
#define _CRCXORL_XOR_POSN                                   0x0
#define _CRCXORL_XOR_POSITION                               0x0
#define _CRCXORL_XOR_SIZE                                   0x8
#define _CRCXORL_XOR_LENGTH                                 0x8
#define _CRCXORL_XOR_MASK                                   0xFF
#define _CRCXORL_XOR0_POSN                                  0x0
#define _CRCXORL_XOR0_POSITION                              0x0
#define _CRCXORL_XOR0_SIZE                                  0x1
#define _CRCXORL_XOR0_LENGTH                                0x1
#define _CRCXORL_XOR0_MASK                                  0x1
#define _CRCXORL_XOR1_POSN                                  0x1
#define _CRCXORL_XOR1_POSITION                              0x1
#define _CRCXORL_XOR1_SIZE                                  0x1
#define _CRCXORL_XOR1_LENGTH                                0x1
#define _CRCXORL_XOR1_MASK                                  0x2
#define _CRCXORL_XOR2_POSN                                  0x2
#define _CRCXORL_XOR2_POSITION                              0x2
#define _CRCXORL_XOR2_SIZE                                  0x1
#define _CRCXORL_XOR2_LENGTH                                0x1
#define _CRCXORL_XOR2_MASK                                  0x4
#define _CRCXORL_XOR3_POSN                                  0x3
#define _CRCXORL_XOR3_POSITION                              0x3
#define _CRCXORL_XOR3_SIZE                                  0x1
#define _CRCXORL_XOR3_LENGTH                                0x1
#define _CRCXORL_XOR3_MASK                                  0x8
#define _CRCXORL_XOR4_POSN                                  0x4
#define _CRCXORL_XOR4_POSITION                              0x4
#define _CRCXORL_XOR4_SIZE                                  0x1
#define _CRCXORL_XOR4_LENGTH                                0x1
#define _CRCXORL_XOR4_MASK                                  0x10
#define _CRCXORL_XOR5_POSN                                  0x5
#define _CRCXORL_XOR5_POSITION                              0x5
#define _CRCXORL_XOR5_SIZE                                  0x1
#define _CRCXORL_XOR5_LENGTH                                0x1
#define _CRCXORL_XOR5_MASK                                  0x20
#define _CRCXORL_XOR6_POSN                                  0x6
#define _CRCXORL_XOR6_POSITION                              0x6
#define _CRCXORL_XOR6_SIZE                                  0x1
#define _CRCXORL_XOR6_LENGTH                                0x1
#define _CRCXORL_XOR6_MASK                                  0x40
#define _CRCXORL_XOR7_POSN                                  0x7
#define _CRCXORL_XOR7_POSITION                              0x7
#define _CRCXORL_XOR7_SIZE                                  0x1
#define _CRCXORL_XOR7_LENGTH                                0x1
#define _CRCXORL_XOR7_MASK                                  0x80

// Register: CRCOUTH
#define CRCOUTH CRCOUTH
extern volatile unsigned char           CRCOUTH             __at(0x1C9F);
#ifndef _LIB_BUILD
asm("CRCOUTH equ 01C9Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OUT                    :8;
    };
    struct {
        unsigned OUT8                   :1;
        unsigned OUT9                   :1;
        unsigned OUT10                  :1;
        unsigned OUT11                  :1;
        unsigned OUT12                  :1;
        unsigned OUT13                  :1;
        unsigned OUT14                  :1;
        unsigned OUT15                  :1;
    };
} CRCOUTHbits_t;
extern volatile CRCOUTHbits_t CRCOUTHbits __at(0x1C9F);
// bitfield macros
#define _CRCOUTH_OUT_POSN                                   0x0
#define _CRCOUTH_OUT_POSITION                               0x0
#define _CRCOUTH_OUT_SIZE                                   0x8
#define _CRCOUTH_OUT_LENGTH                                 0x8
#define _CRCOUTH_OUT_MASK                                   0xFF
#define _CRCOUTH_OUT8_POSN                                  0x0
#define _CRCOUTH_OUT8_POSITION                              0x0
#define _CRCOUTH_OUT8_SIZE                                  0x1
#define _CRCOUTH_OUT8_LENGTH                                0x1
#define _CRCOUTH_OUT8_MASK                                  0x1
#define _CRCOUTH_OUT9_POSN                                  0x1
#define _CRCOUTH_OUT9_POSITION                              0x1
#define _CRCOUTH_OUT9_SIZE                                  0x1
#define _CRCOUTH_OUT9_LENGTH                                0x1
#define _CRCOUTH_OUT9_MASK                                  0x2
#define _CRCOUTH_OUT10_POSN                                 0x2
#define _CRCOUTH_OUT10_POSITION                             0x2
#define _CRCOUTH_OUT10_SIZE                                 0x1
#define _CRCOUTH_OUT10_LENGTH                               0x1
#define _CRCOUTH_OUT10_MASK                                 0x4
#define _CRCOUTH_OUT11_POSN                                 0x3
#define _CRCOUTH_OUT11_POSITION                             0x3
#define _CRCOUTH_OUT11_SIZE                                 0x1
#define _CRCOUTH_OUT11_LENGTH                               0x1
#define _CRCOUTH_OUT11_MASK                                 0x8
#define _CRCOUTH_OUT12_POSN                                 0x4
#define _CRCOUTH_OUT12_POSITION                             0x4
#define _CRCOUTH_OUT12_SIZE                                 0x1
#define _CRCOUTH_OUT12_LENGTH                               0x1
#define _CRCOUTH_OUT12_MASK                                 0x10
#define _CRCOUTH_OUT13_POSN                                 0x5
#define _CRCOUTH_OUT13_POSITION                             0x5
#define _CRCOUTH_OUT13_SIZE                                 0x1
#define _CRCOUTH_OUT13_LENGTH                               0x1
#define _CRCOUTH_OUT13_MASK                                 0x20
#define _CRCOUTH_OUT14_POSN                                 0x6
#define _CRCOUTH_OUT14_POSITION                             0x6
#define _CRCOUTH_OUT14_SIZE                                 0x1
#define _CRCOUTH_OUT14_LENGTH                               0x1
#define _CRCOUTH_OUT14_MASK                                 0x40
#define _CRCOUTH_OUT15_POSN                                 0x7
#define _CRCOUTH_OUT15_POSITION                             0x7
#define _CRCOUTH_OUT15_SIZE                                 0x1
#define _CRCOUTH_OUT15_LENGTH                               0x1
#define _CRCOUTH_OUT15_MASK                                 0x80

// Register: CRCSHFTH
#define CRCSHFTH CRCSHFTH
extern volatile unsigned char           CRCSHFTH            __at(0x1C9F);
#ifndef _LIB_BUILD
asm("CRCSHFTH equ 01C9Fh");
#endif
// aliases
extern volatile unsigned char           CRCSHIFTH           __at(0x1C9F);
#ifndef _LIB_BUILD
asm("CRCSHIFTH equ 01C9Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SHIFT                  :8;
    };
    struct {
        unsigned SHIFT8                 :1;
        unsigned SHIFT9                 :1;
        unsigned SHIFT10                :1;
        unsigned SHIFT11                :1;
        unsigned SHIFT12                :1;
        unsigned SHIFT13                :1;
        unsigned SHIFT14                :1;
        unsigned SHIFT15                :1;
    };
} CRCSHFTHbits_t;
extern volatile CRCSHFTHbits_t CRCSHFTHbits __at(0x1C9F);
// bitfield macros
#define _CRCSHFTH_SHIFT_POSN                                0x0
#define _CRCSHFTH_SHIFT_POSITION                            0x0
#define _CRCSHFTH_SHIFT_SIZE                                0x8
#define _CRCSHFTH_SHIFT_LENGTH                              0x8
#define _CRCSHFTH_SHIFT_MASK                                0xFF
#define _CRCSHFTH_SHIFT8_POSN                               0x0
#define _CRCSHFTH_SHIFT8_POSITION                           0x0
#define _CRCSHFTH_SHIFT8_SIZE                               0x1
#define _CRCSHFTH_SHIFT8_LENGTH                             0x1
#define _CRCSHFTH_SHIFT8_MASK                               0x1
#define _CRCSHFTH_SHIFT9_POSN                               0x1
#define _CRCSHFTH_SHIFT9_POSITION                           0x1
#define _CRCSHFTH_SHIFT9_SIZE                               0x1
#define _CRCSHFTH_SHIFT9_LENGTH                             0x1
#define _CRCSHFTH_SHIFT9_MASK                               0x2
#define _CRCSHFTH_SHIFT10_POSN                              0x2
#define _CRCSHFTH_SHIFT10_POSITION                          0x2
#define _CRCSHFTH_SHIFT10_SIZE                              0x1
#define _CRCSHFTH_SHIFT10_LENGTH                            0x1
#define _CRCSHFTH_SHIFT10_MASK                              0x4
#define _CRCSHFTH_SHIFT11_POSN                              0x3
#define _CRCSHFTH_SHIFT11_POSITION                          0x3
#define _CRCSHFTH_SHIFT11_SIZE                              0x1
#define _CRCSHFTH_SHIFT11_LENGTH                            0x1
#define _CRCSHFTH_SHIFT11_MASK                              0x8
#define _CRCSHFTH_SHIFT12_POSN                              0x4
#define _CRCSHFTH_SHIFT12_POSITION                          0x4
#define _CRCSHFTH_SHIFT12_SIZE                              0x1
#define _CRCSHFTH_SHIFT12_LENGTH                            0x1
#define _CRCSHFTH_SHIFT12_MASK                              0x10
#define _CRCSHFTH_SHIFT13_POSN                              0x5
#define _CRCSHFTH_SHIFT13_POSITION                          0x5
#define _CRCSHFTH_SHIFT13_SIZE                              0x1
#define _CRCSHFTH_SHIFT13_LENGTH                            0x1
#define _CRCSHFTH_SHIFT13_MASK                              0x20
#define _CRCSHFTH_SHIFT14_POSN                              0x6
#define _CRCSHFTH_SHIFT14_POSITION                          0x6
#define _CRCSHFTH_SHIFT14_SIZE                              0x1
#define _CRCSHFTH_SHIFT14_LENGTH                            0x1
#define _CRCSHFTH_SHIFT14_MASK                              0x40
#define _CRCSHFTH_SHIFT15_POSN                              0x7
#define _CRCSHFTH_SHIFT15_POSITION                          0x7
#define _CRCSHFTH_SHIFT15_SIZE                              0x1
#define _CRCSHFTH_SHIFT15_LENGTH                            0x1
#define _CRCSHFTH_SHIFT15_MASK                              0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned SHIFT                  :8;
    };
    struct {
        unsigned SHIFT8                 :1;
        unsigned SHIFT9                 :1;
        unsigned SHIFT10                :1;
        unsigned SHIFT11                :1;
        unsigned SHIFT12                :1;
        unsigned SHIFT13                :1;
        unsigned SHIFT14                :1;
        unsigned SHIFT15                :1;
    };
} CRCSHIFTHbits_t;
