Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f18176.h
extern volatile CCP2PPSbits_t CCP2PPSbits __at(0x1E1F);
// bitfield macros
#define _CCP2PPS_CCP2PPS_POSN                               0x0
#define _CCP2PPS_CCP2PPS_POSITION                           0x0
#define _CCP2PPS_CCP2PPS_SIZE                               0x6
#define _CCP2PPS_CCP2PPS_LENGTH                             0x6
#define _CCP2PPS_CCP2PPS_MASK                               0x3F
#define _CCP2PPS_CCP2PPS0_POSN                              0x0
#define _CCP2PPS_CCP2PPS0_POSITION                          0x0
#define _CCP2PPS_CCP2PPS0_SIZE                              0x1
#define _CCP2PPS_CCP2PPS0_LENGTH                            0x1
#define _CCP2PPS_CCP2PPS0_MASK                              0x1
#define _CCP2PPS_CCP2PPS1_POSN                              0x1
#define _CCP2PPS_CCP2PPS1_POSITION                          0x1
#define _CCP2PPS_CCP2PPS1_SIZE                              0x1
#define _CCP2PPS_CCP2PPS1_LENGTH                            0x1
#define _CCP2PPS_CCP2PPS1_MASK                              0x2
#define _CCP2PPS_CCP2PPS2_POSN                              0x2
#define _CCP2PPS_CCP2PPS2_POSITION                          0x2
#define _CCP2PPS_CCP2PPS2_SIZE                              0x1
#define _CCP2PPS_CCP2PPS2_LENGTH                            0x1
#define _CCP2PPS_CCP2PPS2_MASK                              0x4
#define _CCP2PPS_CCP2PPS3_POSN                              0x3
#define _CCP2PPS_CCP2PPS3_POSITION                          0x3
#define _CCP2PPS_CCP2PPS3_SIZE                              0x1
#define _CCP2PPS_CCP2PPS3_LENGTH                            0x1
#define _CCP2PPS_CCP2PPS3_MASK                              0x8
#define _CCP2PPS_CCP2PPS4_POSN                              0x4
#define _CCP2PPS_CCP2PPS4_POSITION                          0x4
#define _CCP2PPS_CCP2PPS4_SIZE                              0x1
#define _CCP2PPS_CCP2PPS4_LENGTH                            0x1
#define _CCP2PPS_CCP2PPS4_MASK                              0x10
#define _CCP2PPS_CCP2PPS5_POSN                              0x5
#define _CCP2PPS_CCP2PPS5_POSITION                          0x5
#define _CCP2PPS_CCP2PPS5_SIZE                              0x1
#define _CCP2PPS_CCP2PPS5_LENGTH                            0x1
#define _CCP2PPS_CCP2PPS5_MASK                              0x20

// Register: PWMIN0PPS
#define PWMIN0PPS PWMIN0PPS
extern volatile unsigned char           PWMIN0PPS           __at(0x1E24);
#ifndef _LIB_BUILD
asm("PWMIN0PPS equ 01E24h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWMIN0PPS              :6;
    };
} PWMIN0PPSbits_t;
extern volatile PWMIN0PPSbits_t PWMIN0PPSbits __at(0x1E24);
// bitfield macros
#define _PWMIN0PPS_PWMIN0PPS_POSN                           0x0
#define _PWMIN0PPS_PWMIN0PPS_POSITION                       0x0
#define _PWMIN0PPS_PWMIN0PPS_SIZE                           0x6
#define _PWMIN0PPS_PWMIN0PPS_LENGTH                         0x6
#define _PWMIN0PPS_PWMIN0PPS_MASK                           0x3F

// Register: PWMIN1PPS
#define PWMIN1PPS PWMIN1PPS
extern volatile unsigned char           PWMIN1PPS           __at(0x1E25);
#ifndef _LIB_BUILD
asm("PWMIN1PPS equ 01E25h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWMIN1PPS              :6;
    };
} PWMIN1PPSbits_t;
extern volatile PWMIN1PPSbits_t PWMIN1PPSbits __at(0x1E25);
// bitfield macros
#define _PWMIN1PPS_PWMIN1PPS_POSN                           0x0
#define _PWMIN1PPS_PWMIN1PPS_POSITION                       0x0
#define _PWMIN1PPS_PWMIN1PPS_SIZE                           0x6
#define _PWMIN1PPS_PWMIN1PPS_LENGTH                         0x6
#define _PWMIN1PPS_PWMIN1PPS_MASK                           0x3F

// Register: PWM1ERSPPS
#define PWM1ERSPPS PWM1ERSPPS
extern volatile unsigned char           PWM1ERSPPS          __at(0x1E26);
#ifndef _LIB_BUILD
asm("PWM1ERSPPS equ 01E26h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWM1ERSPPS             :6;
    };
} PWM1ERSPPSbits_t;
extern volatile PWM1ERSPPSbits_t PWM1ERSPPSbits __at(0x1E26);
// bitfield macros
#define _PWM1ERSPPS_PWM1ERSPPS_POSN                         0x0
#define _PWM1ERSPPS_PWM1ERSPPS_POSITION                     0x0
#define _PWM1ERSPPS_PWM1ERSPPS_SIZE                         0x6
#define _PWM1ERSPPS_PWM1ERSPPS_LENGTH                       0x6
#define _PWM1ERSPPS_PWM1ERSPPS_MASK                         0x3F

// Register: PWM2ERSPPS
#define PWM2ERSPPS PWM2ERSPPS
extern volatile unsigned char           PWM2ERSPPS          __at(0x1E27);
#ifndef _LIB_BUILD
asm("PWM2ERSPPS equ 01E27h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWM2ERSPPS             :6;
    };
} PWM2ERSPPSbits_t;
extern volatile PWM2ERSPPSbits_t PWM2ERSPPSbits __at(0x1E27);
// bitfield macros
#define _PWM2ERSPPS_PWM2ERSPPS_POSN                         0x0
#define _PWM2ERSPPS_PWM2ERSPPS_POSITION                     0x0
#define _PWM2ERSPPS_PWM2ERSPPS_SIZE                         0x6
#define _PWM2ERSPPS_PWM2ERSPPS_LENGTH                       0x6
#define _PWM2ERSPPS_PWM2ERSPPS_MASK                         0x3F

// Register: PWM3ERSPPS
#define PWM3ERSPPS PWM3ERSPPS
extern volatile unsigned char           PWM3ERSPPS          __at(0x1E28);
#ifndef _LIB_BUILD
asm("PWM3ERSPPS equ 01E28h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWM3ERSPPS             :6;
    };
} PWM3ERSPPSbits_t;
extern volatile PWM3ERSPPSbits_t PWM3ERSPPSbits __at(0x1E28);
// bitfield macros
#define _PWM3ERSPPS_PWM3ERSPPS_POSN                         0x0
#define _PWM3ERSPPS_PWM3ERSPPS_POSITION                     0x0
#define _PWM3ERSPPS_PWM3ERSPPS_SIZE                         0x6
#define _PWM3ERSPPS_PWM3ERSPPS_LENGTH                       0x6
#define _PWM3ERSPPS_PWM3ERSPPS_MASK                         0x3F

// Register: PWM4ERSPPS
#define PWM4ERSPPS PWM4ERSPPS
extern volatile unsigned char           PWM4ERSPPS          __at(0x1E29);
#ifndef _LIB_BUILD
asm("PWM4ERSPPS equ 01E29h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWM4ERSPPS             :6;
    };
} PWM4ERSPPSbits_t;
extern volatile PWM4ERSPPSbits_t PWM4ERSPPSbits __at(0x1E29);
// bitfield macros
#define _PWM4ERSPPS_PWM4ERSPPS_POSN                         0x0
#define _PWM4ERSPPS_PWM4ERSPPS_POSITION                     0x0
#define _PWM4ERSPPS_PWM4ERSPPS_SIZE                         0x6
#define _PWM4ERSPPS_PWM4ERSPPS_LENGTH                       0x6
#define _PWM4ERSPPS_PWM4ERSPPS_MASK                         0x3F

// Register: CWG1PPS
#define CWG1PPS CWG1PPS
extern volatile unsigned char           CWG1PPS             __at(0x1E39);
#ifndef _LIB_BUILD
asm("CWG1PPS equ 01E39h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CWG1PPS                :6;
    };
    struct {
        unsigned CWG1PPS0               :1;
        unsigned CWG1PPS1               :1;
        unsigned CWG1PPS2               :1;
        unsigned CWG1PPS3               :1;
        unsigned CWG1PPS4               :1;
        unsigned CWG1PPS5               :1;
    };
} CWG1PPSbits_t;
